interface var06 {

  public double logika(double d1, double d2, double d3);
  // Äàíû òðè ÷èñëà. 
  //Âûäàòü ïîðÿäêîâûé íîìåð ìåíüøåãî èç íèõ. 

  public void poka(int N);
  // Äàíî öåëîå ÷èñëî N (> 0). 
  //Èñïîëüçóÿ îïåðàöèè äåëåíèÿ íàöåëî è âçÿòèÿ 
  // îñòàòêà îò äåëåíèÿ, íàéòè ÷èñëî, 
  //ïîëó÷åííîå ïðè ïðî÷òåíèè 
  // ÷èñëà N ñïðàâà íàëåâî.

  public void massivy(double[] A);
  // Íàéòè íîìåð ïåðâîãî ëîêàëüíîãî ìèíèìóìà 
  ///ìàññèâà A (ëîêàëüíûé 
  // ìèíèìóì - ýòî ýëåìåíò, êîòîðûé 
  //ìåíüøå ñâîåãî ëåâîãî è ïðàâîãî ñîñåäåé). 

}
